[
  {
    "year": 2026,
    "month": "Jan",
    "title": "AGI Breakthrough",
    "visual": "🧠",
    "summary": "First verified instance of Artificial General Intelligence.",
    "why": "Machines can now perform any intellectual task a human can.",
    "market_analysis": "Global markets halt trading due to volatility. Capital flows aggressively into compute infrastructure and energy sectors.",
    "wiki_url": "https://en.wikipedia.org/wiki/Artificial_general_intelligence",
    "products": [
      "Autonomous Research Assistants",
      "Universal Translators"
    ],
    "stockReaction": "Global markets halt trading due to volatility.",
    "emoji": "🤯",
    "imgQuery": "futuristic artificial general intelligence brain"
  },
  {
    "year": 2025,
    "month": "Late",
    "title": "Solid-State Pilot Lines",
    "visual": "🔋",
    "summary": "Major automakers launch pilot production for solid-state batteries.",
    "why": "The 'Holy Grail' of batteries: lighter, safer, and 2x range compared to Lithium-Ion.",
    "market_analysis": "Battery startups (QuantumScape) and legacy auto stocks fluctuate on prototype results. Reduced reliance on lithium drives commodity market shifts.",
    "wiki_url": "https://en.wikipedia.org/wiki/Solid-state_battery",
    "products": [
      "Solid-State Batteries",
      "Electric Vehicle Packs"
    ],
    "stockReaction": "Battery startups (QuantumScape) and legacy auto stocks fluctuate on prototype results.",
    "emoji": "⚡",
    "imgQuery": "solid state battery technology"
  },
  {
    "year": 2025,
    "month": "Mid",
    "title": "Agentic AI",
    "visual": "🤖",
    "summary": "AI shifts from 'Chatbots' to 'Agents' that perform complex tasks autonomously.",
    "why": "Transforms AI from a conversational tool to a workforce tool.",
    "market_analysis": "Cloud infrastructure stocks (AMZN, MSFT) rally on compute demand. Labor markets begin adjusting to AI automation.",
    "wiki_url": "https://en.wikipedia.org/wiki/Intelligent_agent",
    "products": [
      "AI Workforce Tools",
      "Autonomous Systems"
    ],
    "stockReaction": "Cloud infrastructure stocks (AMZN, MSFT) rally on compute demand.",
    "emoji": "🧠",
    "imgQuery": "artificial intelligence agent futuristic"
  },
  {
    "year": 2025,
    "month": "Late",
    "title": "Initial Air-Taxi Routes",
    "visual": "🛩️",
    "summary": "First limited commercial eVTOL air-taxi routes begin operating in select cities.",
    "why": "Marks the start of practical flying-car style urban air mobility.",
    "market_analysis": "Urban air mobility firms (Joby, Archer) see renewed investor interest as certification and fleet orders translate into early revenue.",
    "products": [
      "eVTOL air taxis",
      "Urban air mobility services"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Urban_air_mobility"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "Paradromics receives FDA IDE approval to begin Connexus BCI Connect-One early feasibility study",
    "visual": "🧠",
    "summary": "Paradromics said the U.S. FDA granted an Investigational Device Exemption (IDE) to start its Connect-One early feasibility study using the fully implantable Connexus brain-computer interface to restore speech and enable computer control for people with severe motor impairment.",
    "why": "It marks a major clinical-validation step for high-bandwidth implantable BCI systems aimed at real-world communication restoration.",
    "market_analysis": "While Paradromics is private, FDA IDE clearance is a credibility catalyst that can accelerate partnerships, recruiting, and funding across the BCI sector as competitors race toward clinical data and reimbursement pathways.",
    "products": [
      "implantable BCI",
      "speech decoding",
      "neural signal processing",
      "assistive communication"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Paradromics",
    "news_url": "https://www.paradromics.com/news/paradromics-receives-fda-approval-for-the-connect-one-clinical-study-with-the-connexus-brain-computer-interface"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "China’s battery and BESS exports surge to record highs in 2025",
    "visual": "🔋",
    "summary": "A Reuters analysis reported China’s exports of batteries and battery energy storage systems (BESS) hit records in 2025, rising sharply year over year and generating tens of billions in export receipts through the first nine months.",
    "why": "Record battery/BESS exports signal accelerating global electrification and grid-storage buildouts that directly feed AI data centers, EVs, and robotics supply chains.",
    "market_analysis": "The export surge reinforces China’s dominance in battery supply and can pressure global pricing while reshaping industrial policy and procurement strategies in major importing regions.",
    "products": [
      "grid-scale BESS",
      "LFP packs",
      "EV cells",
      "data-center storage"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Battery_storage_power_station",
    "news_url": "https://www.reuters.com/markets/commodities/bess-boom-chinas-battery-exports-charge-new-highs-2025-11-18/"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "Cursor’s code-generation AI company valuation jumps to ~$29.3B after new funding round",
    "visual": "🧑‍💻",
    "summary": "Reuters reported that code-generation startup Cursor nearly tripled its valuation in five months, raising $2.3B in a Coatue-led round with participation from Nvidia and Google, among others.",
    "why": "Big-ticket funding for AI coding tools accelerates agentic software development that also powers robotics stacks, automation pipelines, and rapid prototyping across industries.",
    "market_analysis": "The deal underscored continued investor appetite for AI, reinforcing high valuations across the AI tooling ecosystem and signaling sustained capital availability for developer-productivity platforms.",
    "products": [
      "AI codegen",
      "IDE copilots",
      "agentic coding",
      "software automation"
    ],
    "wiki_url": "",
    "news_url": "https://www.reuters.com/technology/code-gen-startup-cursor-valuation-nearly-triples-30-billion-latest-funding-round-2025-11-13/"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "California reports nearly 17,000 MW of battery storage, continuing record growth",
    "visual": "⚡",
    "summary": "California’s Energy Commission announced the state reached 16,942 MW of battery storage available, citing rapid recent additions and framing storage as key to grid reliability alongside renewables.",
    "why": "Large-scale storage buildouts are foundational infrastructure for AI-heavy power demand growth and electrified mobility/robotics expansion.",
    "market_analysis": "Rapid storage deployment supports demand for cells, inverters, EPC services, and grid software, and it provides a policy signal that can de-risk investment in utility-scale storage and behind-the-meter aggregation.",
    "products": [
      "utility-scale storage",
      "virtual power plants",
      "grid balancing",
      "battery inverters"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/California_Energy_Commission",
    "news_url": "https://www.energy.ca.gov/news/2025-11/californias-battery-storage-fleet-continues-record-growth-strengthening-grid"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "UNESCO adopts the first global normative framework on the ethics of neurotechnology",
    "visual": "🧾",
    "summary": "UNESCO announced member states adopted a recommendation establishing safeguards for neurotechnology, including protections around neural data, consent, and risks to vulnerable groups, with entry into force on Nov. 12, 2025.",
    "why": "Global guardrails on neural data and neurotech ethics shape the operating environment for BCIs (and AI models trained on neural signals) before mass commercialization.",
    "market_analysis": "A harmonizing framework can reduce regulatory uncertainty for compliant neurotech developers, but also increases compliance expectations around data handling, transparency, and consumer neurotech claims.",
    "products": [
      "neural data governance",
      "BCI regulation",
      "neurotech compliance",
      "privacy-by-design"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/UNESCO",
    "news_url": "https://www.unesco.org/en/articles/ethics-neurotechnology-unesco-adopts-first-global-standard-cutting-edge-technology"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "Joby begins power-on testing of its first FAA-conforming eVTOL prototype",
    "visual": "🛩️",
    "summary": "Aviation International News reported Joby commenced power-on testing of the first of several aircraft built for FAA type inspection authorization (TIA) testing as it advances its certification program.",
    "why": "FAA-conforming test articles are a key step toward certified eVTOL operations, which depend heavily on advanced autonomy software, avionics, and high-performance batteries.",
    "market_analysis": "Certification progress is a major value driver for public eVTOL developers; concrete test milestones can shift investor sentiment around timelines, partnerships, and eventual commercial launch readiness.",
    "products": [
      "eVTOL certification",
      "flight-control software",
      "electric propulsion",
      "aviation batteries"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Joby_Aviation",
    "news_url": "https://www.ainonline.com/aviation-news/futureflight/2025-11-06/joby-starts-power-testing-first-faa-conforming-prototype"
  },
  {
    "year": 2025,
    "month": "Nov",
    "title": "Schaeffler partners with Neura Robotics to develop and supply humanoid components",
    "visual": "🤖",
    "summary": "Reuters reported Schaeffler partnered with Neura Robotics to jointly develop and supply key components for humanoid robots, and said it plans to integrate a mid-four-digit number of humanoids into production by 2035.",
    "why": "It signals industrial-scale commitment to humanoids, accelerating demand for robot hardware, perception, and AI control stacks in real factories.",
    "market_analysis": "Moves by established industrial suppliers validate humanoid commercialization paths and can stimulate supplier ecosystems (actuators, sensors, safety systems) while increasing competitive pressure on automation incumbents.",
    "products": [
      "humanoid components",
      "industrial automation",
      "robot actuators",
      "factory robotics"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Schaeffler",
    "news_url": "https://www.reuters.com/world/china/schaeffler-partners-with-neura-robotics-develop-supply-humanoids-2025-11-04/"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "Nvidia hits ~$5 trillion market valuation as the AI boom powers a meteoric rise",
    "visual": "🧠",
    "summary": "Reuters reported Nvidia became the first company to reach a roughly $5 trillion market capitalization as enthusiasm around AI infrastructure spending surged.",
    "why": "Nvidia’s valuation milestone reflects how foundational AI compute has become for modern software, robotics perception, and autonomy stacks.",
    "market_analysis": "A $5T valuation milestone reinforces AI-capex dominance across semis, cloud, and data centers, often lifting the broader AI supply chain while increasing sensitivity to any demand/capex guidance changes.",
    "products": [
      "AI accelerators",
      "AI data centers",
      "LLM training",
      "robotics perception"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Nvidia",
    "news_url": "https://www.reuters.com/business/nvidia-poised-record-5-trillion-market-valuation-2025-10-29/"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "Joby and Archer publicly demonstrate eVTOL ‘flying taxis’ at a U.S. airshow",
    "visual": "🛩️",
    "summary": "Business Insider reported Joby Aviation and Archer Aviation flew public demonstrations at the California International Airshow, showcasing their eVTOL aircraft to a large U.S. crowd.",
    "why": "High-visibility public demos are key to mainstream acceptance and help de-risk the path to certification and commercial operations for eVTOLs.",
    "market_analysis": "Public demonstrations can materially affect sentiment for pre-revenue eVTOL makers by validating progress and increasing media attention, often moving investor expectations around certification timelines and near-term partnerships.",
    "products": [
      "eVTOL air taxi",
      "electric propulsion",
      "flight-control software",
      "aviation batteries"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Electric_vertical_take-off_and_landing",
    "news_url": "https://www.businessinsider.com/joby-archer-aviation-evtol-flying-taxis-first-us-public-airshow-2025-10"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "1X launches consumer pre-orders for its NEO humanoid home robot",
    "visual": "🤖",
    "summary": "1X announced the launch of NEO, positioning it as a consumer-oriented humanoid robot for household tasks and opening preorders.",
    "why": "Consumer preorders are a meaningful commercialization step for humanoids, pushing embodied AI from labs into real homes and real-world data loops.",
    "market_analysis": "A consumer preorder milestone can stimulate the broader humanoid ecosystem (actuators, safety, teleop, on-device AI) and intensify competition for home-robot form factors and operating models.",
    "products": [
      "home humanoid",
      "teleoperation assist",
      "vision-language control",
      "safe actuators"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/1X_Technologies",
    "news_url": "https://www.1x.tech/discover/neo-home-robot"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "Europe’s first BCI implant for a quadriplegia patient performed at TUM University Hospital",
    "visual": "🧠",
    "summary": "TUM reported a team implanted a 256-microelectrode brain-computer interface in a patient with quadriplegia, described as the first such procedure of its kind in Europe for this indication, aiming toward thought-based control of a smartphone and robotic arm.",
    "why": "This expands clinical BCI momentum in Europe and directly links AI decoding to practical control of assistive robotics.",
    "market_analysis": "Credible hospital-led implants can accelerate grant funding, partnerships, and device/algorithm standardization—key ingredients for eventual scaled neurotech markets and downstream assistive-robotics demand.",
    "products": [
      "implantable BCI",
      "neural decoding AI",
      "assistive robotics",
      "cursor/arm control"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface",
    "news_url": "https://www.tum.de/en/news-and-events/all-news/press-releases/details/brain-computer-interface-for-a-patient-with-quadriplegia"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "Ameresco announces commercial operation of a 50MW/200MWh behind-the-meter BESS for Nucor in Arizona",
    "visual": "🔋",
    "summary": "Ameresco announced the development and commercial operation of a 50MW/200MWh battery energy storage system in Kingman, Arizona, described as the largest behind-the-meter storage project in the state.",
    "why": "Industrial behind-the-meter storage helps stabilize power demand for electrified manufacturing—an enabling layer for EV, robotics, and AI-heavy industrial growth.",
    "market_analysis": "High-profile BESS go-lives support demand for integrators, long-term storage services contracts, and large-format battery packs, while signaling continued buildout beyond utility-front-of-meter projects.",
    "products": [
      "behind-the-meter BESS",
      "peak shaving",
      "industrial electrification",
      "Megapack-scale systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Ameresco",
    "news_url": "https://ir.ameresco.com/news-events/press-releases/detail/727/ameresco-announces-50mw-battery-energy-storage-asset-to"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "SolarEdge surpasses 500 MWh of storage deployed in virtual power plants",
    "visual": "⚡",
    "summary": "SolarEdge announced it surpassed 500 MWh of residential battery storage deployed in virtual power plants across multiple markets.",
    "why": "VPP-scale residential storage is increasingly important for grid flexibility as electrification and data-center demand accelerate.",
    "market_analysis": "VPP milestones strengthen the market case for aggregated storage and grid services revenues, impacting the competitive landscape for inverter + storage ecosystems and utility programs.",
    "products": [
      "virtual power plant",
      "residential storage",
      "grid services",
      "smart inverters"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/SolarEdge",
    "news_url": "https://investors.solaredge.com/news-releases/news-release-details/solaredge-surpasses-500-mwh-storage-virtual-power-plants-across"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "Serve Robotics partners with DoorDash to deploy sidewalk delivery robots",
    "visual": "🛵",
    "summary": "Reuters reported Serve Robotics partnered with DoorDash to deploy its sidewalk delivery robots, expanding beyond its earlier Uber Eats relationship and planning broader rollout.",
    "why": "Last-mile delivery robotics is a practical commercialization path for autonomy, perception, and fleet-ops AI in dense real-world environments.",
    "market_analysis": "Reuters noted Serve’s shares surged on the announcement, highlighting how revenue-distribution partnerships can re-rate robotics companies by improving utilization and market reach.",
    "products": [
      "delivery robots",
      "autonomous navigation",
      "fleet operations",
      "remote teleop"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Delivery_robot",
    "news_url": "https://www.reuters.com/business/delivery-robot-firm-serve-robotics-partners-with-doordash-expand-reach-2025-10-09/"
  },
  {
    "year": 2025,
    "month": "Oct",
    "title": "Reuters: Chinese humanoid robot maker AgiBot plans a Hong Kong IPO",
    "visual": "🏭",
    "summary": "Reuters reported sources saying AgiBot planned a Hong Kong IPO, targeting a multibillion-dollar valuation for its humanoid robotics business.",
    "why": "An IPO pipeline for humanoid robotics signals maturation of the sector and expands capital access for scaling manufacturing and embodied-AI development.",
    "market_analysis": "IPO plans can catalyze peer valuations and investor interest in embodied AI, while also increasing scrutiny on unit economics, deployment traction, and safety/compliance strategies.",
    "products": [
      "humanoid robots",
      "embodied AI",
      "robot training data",
      "factory automation"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/AgiBot",
    "news_url": "https://www.reuters.com/world/china/chinese-robot-maker-agibot-plans-hong-kong-ipo-next-year-sources-say-2025-10-10/"
  },
  {
    "year": 2024,
    "month": "Nov",
    "title": "Noninvasive Brain Decoding Advances",
    "visual": "📡",
    "summary": "AI models paired with wearable EEG/fNIRS improve decoding of intent, imagery, and text without implants.",
    "why": "Lower-barrier brain–computer interfaces accelerate mind-controlled computing and assistive tech.",
    "market_analysis": "BCI and neurotech startups attract new funding; consumer-grade neural wearables expand beyond wellness into productivity and accessibility.",
    "products": [
      "Wearable BCIs",
      "Neuroadaptive interfaces",
      "Assistive communication tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface"
  },
  {
    "year": 2024,
    "month": "Apr",
    "title": "eVTOL Certification Frameworks Mature",
    "visual": "📜",
    "summary": "Regulators finalize clearer certification paths for electric vertical takeoff and landing aircraft.",
    "why": "Turns eVTOLs from prototypes into certifiable products, unlocking scaled deployment.",
    "market_analysis": "Manufacturers secure preorders and partnerships with airlines and cities; suppliers of batteries, avionics, and autonomy systems benefit.",
    "products": [
      "Certified eVTOL aircraft",
      "Urban air mobility fleets",
      "Autonomous flight software"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/EVTOL"
  },
  {
    "year": 2024,
    "month": "Jan",
    "title": "Neuralink First Human Implant",
    "visual": "🧠",
    "summary": "Neuralink implants its first brain–computer interface in a human trial participant.",
    "why": "Demonstrates high-channel implants enabling thought-to-cursor control and future neuroprosthetics.",
    "market_analysis": "Neurotech investment accelerates; raises expectations for clinical BCIs and the long-term brain-to-computer market.",
    "products": [
      "Implantable BCIs",
      "Neuroprosthetic control systems",
      "Assistive cursor/typing tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Neuralink"
  },
  {
    "year": 2024,
    "month": "Oct",
    "title": "Tesla \"We, Robot\"",
    "visual": "🚕",
    "summary": "Tesla unveils Cybercab and Optimus Gen 3 updates.",
    "why": "Signals full pivot to robotics over traditional cars.",
    "market_analysis": "High volatility in TSLA as market debates timeline. Robotics investments surge globally.",
    "wiki_url": "https://en.wikipedia.org/wiki/Tesla_Robotaxi",
    "products": [
      "Autonomous Vehicles",
      "Humanoid Robots"
    ],
    "stockReaction": "High volatility in TSLA as market debates timeline.",
    "emoji": "🚕",
    "imgQuery": "cyberpunk autonomous taxi"
  },
  {
    "year": 2024,
    "month": "Mar",
    "title": "Claude 3 Launch",
    "visual": "📝",
    "summary": "Anthropic releases Claude 3 (Opus), surpassing GPT-4.",
    "why": "Ended OpenAI monopoly on top-tier reasoning.",
    "market_analysis": "GOOG and MSFT adjusted as AI race became a three-way battle. Increased competition drives innovation in AI safety.",
    "wiki_url": "https://en.wikipedia.org/wiki/Claude_(language_model)",
    "products": [
      "Advanced Language Models",
      "AI Safety Tools"
    ],
    "stockReaction": "GOOG and MSFT adjusted as AI race became a three-way battle.",
    "emoji": "📜",
    "imgQuery": "ai writing code screen"
  },
  {
    "year": 2024,
    "month": "Mar",
    "title": "Figure 01 Demo",
    "visual": "🦿",
    "summary": "Figure AI robot holds conversation and performs tasks.",
    "why": "First convincing demo of LLM-brained humanoid.",
    "market_analysis": "Sparked massive VC investment in robotics. Accelerates humanoid robot development.",
    "wiki_url": "https://en.wikipedia.org/wiki/Figure_(robotics_company)",
    "products": [
      "Humanoid Robots",
      "AI-Integrated Devices"
    ],
    "stockReaction": "Sparked massive VC investment in robotics.",
    "emoji": "🦾",
    "imgQuery": "humanoid robot handing apple"
  },
  {
    "year": 2024,
    "month": "Feb",
    "title": "Gemini 1.5 Pro",
    "visual": "💎",
    "summary": "Google launches 1-million token context window.",
    "why": "Allowed AI to read entire books/codebases at once.",
    "market_analysis": "Alphabet (GOOG) rallied on technical leadership. Boosts productivity in software development.",
    "wiki_url": "https://en.wikipedia.org/wiki/Gemini_(language_model)",
    "products": [
      "Large Context AI Models",
      "Code Analysis Tools"
    ],
    "stockReaction": "Alphabet (GOOG) rallied on technical leadership.",
    "emoji": "💠",
    "imgQuery": "google gemini ai abstract"
  },
  {
    "year": 2024,
    "month": "Mar",
    "title": "NVIDIA Blackwell GPUs",
    "visual": "🟩",
    "summary": "NVIDIA announces its Blackwell architecture (B100/B200) aimed at next-gen AI training and inference.",
    "market_analysis": "Hyperscalers accelerate data-center CAPEX and pre-order Blackwell systems; NVIDIA's valuation tops $2T as AI server demand surges.",
    "products": [
      "AI accelerators",
      "AI servers",
      "Enterprise inference"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Nvidia_Blackwell"
  },
  {
    "year": 2024,
    "month": "Feb",
    "title": "Apple Vision Pro Launch",
    "visual": "🕶️",
    "summary": "Apple ships its first spatial computing headset, Vision Pro, to consumers in the United States.",
    "market_analysis": "Kickstarts premium AR/VR spending; catalyzes spatial app development and lifts suppliers of micro-OLED displays and 3D sensors.",
    "products": [
      "Spatial apps",
      "3D collaboration tools",
      "Immersive media"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Apple_Vision_Pro"
  },
  {
    "year": 2024,
    "month": "Feb",
    "title": "OpenAI Sora Text-to-Video",
    "visual": "🎥",
    "summary": "OpenAI unveils Sora, generating high-fidelity videos directly from text prompts.",
    "market_analysis": "AI video enters production pipelines; advertisers and studios pilot synthetic content while cloud GPU demand and copyright debates intensify.",
    "products": [
      "AI video ads",
      "Virtual production",
      "Synthetic datasets"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/OpenAI_Sora"
  },
  {
    "year": 2024,
    "month": "Feb",
    "title": "Google Gemini Long-Context Release",
    "visual": "🌟",
    "summary": "Google rolls out Gemini 1.5 with million-token context and stronger multimodal reasoning across Workspace and Bard.",
    "market_analysis": "Raises expectations for long-context AI; prompts enterprises to test Gemini Advanced and heats competition with OpenAI and Anthropic.",
    "products": [
      "AI copilots",
      "Document analysis",
      "Video question answering"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Google_Gemini"
  },
  {
    "year": 2023,
    "month": "Sep",
    "title": "Autonomous Air Taxi Programs Expand",
    "visual": "🛫",
    "summary": "eVTOL companies scale autonomous flight testing and urban air-taxi pilot programs.",
    "why": "Brings AI autonomy into aviation, a key step toward safe pilotless urban flight.",
    "market_analysis": "Partnerships with cities and airlines grow; autonomy and safety validation becomes a major competitive differentiator.",
    "products": [
      "Autonomous air taxis",
      "Urban air mobility trials",
      "Aviation autonomy stacks"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Urban_air_mobility"
  },
  {
    "year": 2023,
    "month": "Aug",
    "title": "Speech From Brain Signals",
    "visual": "🗣️",
    "summary": "Research teams decode near-real-time speech and text from cortical signals for people with paralysis.",
    "why": "Shows BCIs can restore communication at conversational speed.",
    "market_analysis": "Hospitals and device makers begin planning clinical pathways; AI-driven neuroprosthetics gain momentum.",
    "products": [
      "Speech neuroprosthetics",
      "Clinical BCI systems",
      "Assistive communication devices"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface"
  },
  {
    "year": 2023,
    "month": "Dec",
    "title": "Optimus Gen 2",
    "visual": "🦾",
    "summary": "Tesla reveals faster, lighter Optimus Gen 2.",
    "why": "Demonstrated rapid hardware iteration.",
    "market_analysis": "Reinforced Tesla robotics narrative. Advances in humanoid robotics for manufacturing.",
    "wiki_url": "https://en.wikipedia.org/wiki/Tesla_Optimus",
    "products": [
      "Humanoid Robots",
      "Robotic Actuators"
    ],
    "stockReaction": "Reinforced Tesla robotics narrative.",
    "emoji": "🤖",
    "imgQuery": "tesla optimus robot"
  },
  {
    "year": 2023,
    "month": "Aug",
    "title": "Robotaxis 24/7",
    "visual": "🚦",
    "summary": "SF approves 24/7 paid driverless rides.",
    "why": "Commercial validation of Level 4 autonomy.",
    "market_analysis": "Waymo solidified lead; Uber/Lyft partnerships followed. Accelerates autonomous vehicle adoption.",
    "wiki_url": "https://en.wikipedia.org/wiki/Robotaxi",
    "products": [
      "Autonomous Vehicles",
      "Ride-Sharing Platforms"
    ],
    "stockReaction": "Waymo solidified lead; Uber/Lyft partnerships followed.",
    "emoji": "🚗",
    "imgQuery": "self driving car san francisco"
  },
  {
    "year": 2022,
    "month": "Nov",
    "title": "ChatGPT Launch",
    "visual": "💬",
    "summary": "OpenAI releases ChatGPT to the public.",
    "why": "The 'iPhone Moment' for AI.",
    "market_analysis": "Triggered multi-trillion dollar AI bull market. Democratized AI access globally.",
    "wiki_url": "https://en.wikipedia.org/wiki/ChatGPT",
    "products": [
      "Conversational AI",
      "Generative Models"
    ],
    "stockReaction": "Triggered multi-trillion dollar AI bull market.",
    "emoji": "🚀",
    "imgQuery": "chatgpt openai logo digital"
  },
  {
    "year": 2021,
    "month": "Jul",
    "title": "AlphaFold 2 Open Release",
    "visual": "🧬",
    "summary": "DeepMind releases AlphaFold 2 predictions and tooling broadly, making high-accuracy protein structures accessible.",
    "why": "Applies deep learning to biology at scale, reshaping drug discovery and synthetic biology.",
    "market_analysis": "Biotech and pharma accelerate AI adoption; demand rises for AI-first lab automation and molecular design platforms.",
    "products": [
      "Protein-structure databases",
      "AI drug discovery tools",
      "Biology foundation models"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/AlphaFold"
  },
  {
    "year": 2021,
    "month": "Apr",
    "title": "Neuralink Monkey Cursor Demo",
    "visual": "🐒",
    "summary": "Neuralink shows a monkey playing simple video games by controlling a cursor with neural signals.",
    "why": "Public proof that high-channel BCIs can decode motor intent reliably.",
    "market_analysis": "Boosts neurotech visibility and funding; sparks competition among implantable and noninvasive BCI startups.",
    "products": [
      "Implantable neural interfaces",
      "Motor-intent decoders",
      "Neurorehabilitation devices"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Neuralink"
  },
  {
    "year": 2021,
    "month": "Jul",
    "title": "Sodium-Ion Battery",
    "visual": "🧂",
    "summary": "CATL unveils Sodium-Ion tech.",
    "why": "Reduces reliance on scarce lithium.",
    "market_analysis": "CATL stock surged; raw material markets shifted. Lowers battery costs for EVs.",
    "wiki_url": "https://en.wikipedia.org/wiki/Sodium-ion_battery",
    "products": [
      "Sodium-Ion Batteries",
      "Energy Storage Systems"
    ],
    "stockReaction": "CATL stock surged; raw material markets shifted.",
    "emoji": "🔋",
    "imgQuery": "salt crystal battery energy"
  },
  {
    "year": 2020,
    "month": "Nov",
    "title": "Apple M1 Chip",
    "visual": "💻",
    "summary": "Apple shifts Macs to custom Silicon.",
    "why": "Revolutionized laptop efficiency.",
    "market_analysis": "Apple margins rose; Intel declined. Boosts ARM-based computing adoption.",
    "wiki_url": "https://en.wikipedia.org/wiki/Apple_M1",
    "products": [
      "Custom Silicon Chips",
      "Efficient Laptops"
    ],
    "stockReaction": "Apple margins rose; Intel declined.",
    "emoji": "🍏",
    "imgQuery": "computer processor chip macro"
  },
  {
    "year": 2019,
    "month": "Jun",
    "title": "Piloted eVTOL Urban Test Flights",
    "visual": "🏙️",
    "summary": "Early eVTOL aircraft complete piloted urban demonstration flights, validating electric lift and control.",
    "why": "Shows electric vertical flight is viable for short-range city mobility.",
    "market_analysis": "Triggers new rounds of investment into eVTOL makers and battery supply chains for aviation-grade cells.",
    "products": [
      "eVTOL prototypes",
      "Urban flight test programs",
      "Aviation battery packs"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/EVTOL"
  },
  {
    "year": 2019,
    "month": "Oct",
    "title": "BERT Powers Google Search",
    "visual": "🔍",
    "summary": "Google deploys the BERT language model in search ranking to better understand natural language queries.",
    "market_analysis": "Signals mainstream NLP adoption; SEO and ad-tech firms adapt content strategies around conversational search.",
    "products": [
      "Search ranking",
      "Enterprise NLP",
      "Voice assistants"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/BERT_(language_model)"
  },
  {
    "year": 2018,
    "month": "Dec",
    "title": "AlphaFold Wins CASP13",
    "visual": "🧬",
    "summary": "DeepMind's AlphaFold system achieves breakthrough performance in the CASP13 protein-folding competition.",
    "why": "Demonstrates deep learning can solve core scientific prediction tasks, expanding AI beyond language and vision.",
    "market_analysis": "Signals AI's potential in biotech and materials; early investment grows in AI-driven labs and molecular simulation.",
    "products": [
      "Protein-folding models",
      "Scientific AI platforms",
      "Molecular simulation tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/AlphaFold"
  },
  {
    "year": 2017,
    "month": "",
    "title": "eVTOL Funding Boom",
    "visual": "💸",
    "summary": "Major venture and aerospace investment pours into eVTOL startups like Joby, Lilium, and Volocopter.",
    "why": "Kickstarts the modern flying-car industry backed by electric power and autonomous flight R&D.",
    "market_analysis": "Raises valuations across the sector; batteries and autonomy become strategic bottlenecks for commercialization.",
    "products": [
      "eVTOL startups",
      "Urban air mobility platforms",
      "Flight autonomy research"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Urban_air_mobility"
  },
  {
    "year": 2017,
    "month": "Jun",
    "title": "Transformer Architecture Introduced",
    "visual": "🧠",
    "summary": "Vaswani et al. publish \"Attention Is All You Need,\" introducing the Transformer model architecture.",
    "market_analysis": "Sets foundation for modern LLMs; drives GPU demand and a wave of startups building generative AI products.",
    "products": [
      "Large language models",
      "Translation engines",
      "AI developer platforms"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Transformer_(machine_learning_model)"
  },
  {
    "year": 2016,
    "month": "Jul",
    "title": "Neuralink Founded",
    "visual": "🔌",
    "summary": "Elon Musk co-founds Neuralink to develop implantable brain–computer interfaces.",
    "why": "Aims to create high-bandwidth links between neurons and computers for medical and eventually general-use applications.",
    "market_analysis": "Accelerates the neurotech race; more capital flows into BCI hardware, signal decoding, and regulatory pathways.",
    "products": [
      "Implantable BCIs",
      "Neural recording devices",
      "Neurostimulation systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Neuralink"
  },
  {
    "year": 2016,
    "month": "Feb",
    "title": "Closed-Loop Neuroprosthetics",
    "visual": "🦾",
    "summary": "Neuroprosthetic systems begin combining brain-controlled movement with sensory feedback loops.",
    "why": "Turns prosthetics from one-way tools into more natural, learnable extensions of the body.",
    "market_analysis": "Clinical robotics and neurodevice makers expand trials; AI decoding and stimulation become a key growth area.",
    "products": [
      "Sensory-feedback prosthetics",
      "BCI rehabilitation systems",
      "Neural stimulation devices"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Neuroprosthetics"
  },
  {
    "year": 2016,
    "month": "Mar",
    "title": "AlphaGo Beats Lee Sedol",
    "visual": "🥋",
    "summary": "DeepMind's AlphaGo defeats Go champion Lee Sedol, showcasing deep reinforcement learning at scale.",
    "market_analysis": "Catalyzes investment in deep learning; accelerates AI hiring and specialized chip roadmaps across Asia.",
    "products": [
      "Reinforcement learning platforms",
      "AI accelerators",
      "AI research services"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/AlphaGo_versus_Lee_Sedol"
  },
  {
    "year": 2014,
    "month": "Jun",
    "title": "GANs Introduced",
    "visual": "🎨",
    "summary": "Ian Goodfellow proposes Generative Adversarial Networks (GANs) for realistic synthetic data generation.",
    "why": "Opens the door to modern generative AI for images, video, and simulation data used in robotics training.",
    "market_analysis": "Seeds a wave of generative startups and later deepfakes; synthetic data becomes a valuable AI commodity.",
    "products": [
      "Generative image models",
      "Synthetic training datasets",
      "Simulation tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Generative_adversarial_network"
  },
  {
    "year": 2013,
    "month": "",
    "title": "Deep Q-Networks (DQN) Atari Breakthrough",
    "visual": "🎮",
    "summary": "DeepMind demonstrates that a single deep reinforcement learning agent can learn to play dozens of Atari games directly from pixels.",
    "why": "Proved deep reinforcement learning could scale beyond toy problems, paving the way for AlphaGo-style systems and modern robotics control.",
    "market_analysis": "Renewed interest in reinforcement learning for autonomy, leading to increased research funding and early industrial pilots in robotics and simulation.",
    "products": [
      "Reinforcement learning agents",
      "Robotics control policies",
      "Game AI systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Deep_reinforcement_learning"
  },
  {
    "year": 2013,
    "month": "May",
    "title": "fMRI Mind-Reading Studies",
    "visual": "🧠",
    "summary": "Machine learning models reconstruct viewed images and words from fMRI brain scans with increasing fidelity.",
    "why": "Demonstrates the feasibility of decoding mental content, a key step toward higher-level BCIs.",
    "market_analysis": "Boosts academic and commercial interest in neuro-AI; imaging hardware and decoding software ecosystems expand.",
    "products": [
      "Neural decoding models",
      "Brain-imaging analytics",
      "Neuro-AI research tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Functional_magnetic_resonance_imaging"
  },
  {
    "year": 2012,
    "month": "Apr",
    "title": "Brain-Controlled Prosthetic Hand Trials",
    "visual": "✋",
    "summary": "Clinical studies demonstrate people can control prosthetic hands using implanted or surface neural signals.",
    "why": "Proves BCIs can drive fine motor robotics for real-world assistive use.",
    "market_analysis": "Clinical robotics and medtech investors increase BCI funding; accelerates translation of lab BCIs into products.",
    "products": [
      "BCI prosthetic hands",
      "Neural decoding software",
      "Rehabilitation robotics"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface"
  },
  {
    "year": 2012,
    "month": "Dec",
    "title": "AlexNet Wins ImageNet",
    "visual": "📸",
    "summary": "AlexNet's CNN architecture wins ImageNet with a large margin using GPU acceleration.",
    "market_analysis": "Triggers deep learning boom; GPU sales and cloud ML services grow as vision models enter commercial apps.",
    "products": [
      "Image recognition APIs",
      "Autonomous vehicles",
      "Retail vision systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/AlexNet"
  },
  {
    "year": 2009,
    "month": "",
    "title": "ImageNet Dataset Released",
    "visual": "🖼️",
    "summary": "Fei-Fei Li's team publishes ImageNet, a massive labeled image dataset and benchmark for computer vision.",
    "why": "Standardized large-scale training and evaluation, enabling the deep learning surge in visual recognition.",
    "market_analysis": "Accelerated demand for GPUs and cloud training; seeded the modern computer-vision industry used in phones, cars, and factories.",
    "products": [
      "Computer vision benchmarks",
      "Image classification models",
      "Data labeling platforms"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/ImageNet"
  },
  {
    "year": 2009,
    "month": "",
    "title": "Modern eVTOL Prototypes Emerge",
    "visual": "🚁",
    "summary": "Early electric VTOL prototypes appear, combining lightweight batteries with distributed electric propulsion.",
    "why": "Starts the modern flying-car era enabled by advances in batteries and flight control software.",
    "market_analysis": "Signals a new aviation category; battery energy density becomes a strategic constraint for the sector.",
    "products": [
      "eVTOL prototypes",
      "Distributed electric propulsion",
      "Aviation autonomy systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/EVTOL"
  },
  {
    "year": 2007,
    "month": "Jun",
    "title": "First iPhone Released",
    "visual": "📱",
    "summary": "Apple ships the original iPhone, popularizing the modern smartphone form factor and mobile apps.",
    "market_analysis": "Creates trillion-dollar mobile ecosystem; carriers revamp data plans and app stores become core revenue streams.",
    "products": [
      "Smartphones",
      "Mobile apps",
      "Mobile broadband"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/IPhone_(1st_generation)"
  },
  {
    "year": 2006,
    "month": "",
    "title": "Deep Learning Revival",
    "visual": "📈",
    "summary": "Geoffrey Hinton and collaborators revive interest in multi-layer neural networks with techniques like deep belief nets and improved training.",
    "why": "Restarted deep neural network research after the AI winters, setting the stage for 2010s breakthroughs.",
    "market_analysis": "Shifted academic and early industry attention back toward neural nets, influencing later investments in speech, vision, and recommendation systems.",
    "products": [
      "Deep neural network models",
      "Speech recognition engines",
      "Representation learning tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Deep_learning"
  },
  {
    "year": 2006,
    "month": "",
    "title": "ECoG High-Bandwidth BCI Advances",
    "visual": "🧠",
    "summary": "Electrocorticography (ECoG) studies show higher-bandwidth neural recording that improves cursor and motor decoding.",
    "why": "Bridges the gap between noninvasive EEG and fully implanted arrays, enabling more precise mind-controlled interfaces.",
    "market_analysis": "Strengthens clinical BCI pathways; spurs investment into neural signal decoding and surgical neurotech.",
    "products": [
      "Clinical BCI implants",
      "Neural decoding algorithms",
      "Motor-intent interfaces"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Electrocorticography"
  },
  {
    "year": 2002,
    "month": "",
    "title": "Roomba Consumer Robot",
    "visual": "🧹",
    "summary": "iRobot launches Roomba, the first widely successful household robot vacuum.",
    "why": "Brought autonomous robotics into millions of homes and proved consumer demand for service robots.",
    "market_analysis": "Created a new consumer robotics category and stimulated investment in home automation and low-cost sensing/navigation.",
    "products": [
      "Robot vacuums",
      "Home service robots",
      "Domestic navigation sensors"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Roomba"
  },
  {
    "year": 2002,
    "month": "",
    "title": "Mind-Controlled Robotic Arm Demo",
    "visual": "🦾",
    "summary": "Researchers demonstrate controlling a robotic arm using neural signals from the brain.",
    "why": "First clear link between BCIs and physical robotics actuation.",
    "market_analysis": "Expands funding for neuroprosthetics and rehabilitation robotics.",
    "products": [
      "BCI robot arms",
      "Neuroprosthetic controllers",
      "Rehabilitation robots"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface"
  },
  {
    "year": 1998,
    "month": "Sep",
    "title": "Google Founded",
    "visual": "📈",
    "summary": "Larry Page and Sergey Brin launch Google, introducing PageRank-driven web search.",
    "market_analysis": "Kickstarts search advertising as a dominant online revenue model; venture funding flows into search and ad-tech.",
    "products": [
      "Search engines",
      "Online advertising",
      "Web analytics"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Google"
  },
  {
    "year": 1998,
    "month": "",
    "title": "LeNet-5 CNN Deployed",
    "visual": "🔢",
    "summary": "LeCun's LeNet-5 convolutional neural network is used commercially for handwriting recognition.",
    "why": "One of the first real-world deployments of CNNs, proving neural nets could outperform rule-based vision.",
    "market_analysis": "Early commercial success for neural networks in banking and document processing.",
    "products": [
      "Handwriting OCR",
      "Document digitization",
      "Early CNN software"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/LeNet"
  },
  {
    "year": 1998,
    "month": "",
    "title": "First Implanted BCI Cursor Control",
    "visual": "🖱️",
    "summary": "Implanted electrodes enable basic cursor and selection control directly from motor cortex activity.",
    "why": "First implanted BCI showing practical control of a computer without muscles.",
    "market_analysis": "Sets the stage for clinical BCI programs and later high-channel implants.",
    "products": [
      "Implantable neural interfaces",
      "Assistive cursor systems",
      "Neurorehabilitation tools"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface"
  },
  {
    "year": 1997,
    "month": "",
    "title": "Deep Blue Beats Kasparov",
    "visual": "♟️",
    "summary": "IBM's chess supercomputer Deep Blue defeats world champion Garry Kasparov in a historic match.",
    "why": "Showcased the power of search, heuristics, and specialized hardware, shifting public expectations about machine intelligence.",
    "market_analysis": "Sparked a late-90s AI surge in corporate labs and highlighted the value of compute-heavy approaches.",
    "products": [
      "Game-playing AI",
      "Decision-support systems",
      "Specialized compute hardware"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Deep_Blue_versus_Garry_Kasparov"
  },
  {
    "year": 1991,
    "month": "",
    "title": "Li-Ion Commercialized",
    "visual": "🔋",
    "summary": "Sony commercializes the Lithium-Ion battery.",
    "why": "Enabled the portable electronics revolution (laptops, phones).",
    "market_analysis": "Fueled the consumer electronics boom of the 90s. Created global lithium demand.",
    "wiki_url": "https://en.wikipedia.org/wiki/Lithium-ion_battery",
    "products": [
      "Lithium-Ion Batteries",
      "Portable Electronics"
    ],
    "stockReaction": "Fueled the consumer electronics boom of the 90s.",
    "emoji": "📼",
    "imgQuery": "vintage sony battery 1990"
  },
  {
    "year": 1991,
    "month": "Aug",
    "title": "Linux Kernel Announced",
    "visual": "🐧",
    "summary": "Linus Torvalds releases the Linux kernel, sparking the modern open-source operating system movement.",
    "market_analysis": "Drives proliferation of open-source software; underpins enterprise servers, cloud infrastructure, and Android.",
    "products": [
      "Servers",
      "Cloud platforms",
      "Embedded systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Linux"
  },
  {
    "year": 1989,
    "month": "",
    "title": "World Wide Web",
    "visual": "🌐",
    "summary": "Tim Berners-Lee invents the World Wide Web.",
    "market_analysis": "Dot-com boom; internet economy reaches trillions.",
    "products": [
      "Websites",
      "E-commerce Platforms",
      "Social Networks"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/World_Wide_Web"
  },
  {
    "year": 1989,
    "month": "",
    "title": "Convolutional Neural Networks (LeNet Era)",
    "visual": "🧠",
    "summary": "Yann LeCun develops early convolutional neural networks for handwritten digit recognition.",
    "why": "Introduces a scalable architecture for vision that becomes central to modern AI and robotics perception.",
    "market_analysis": "Research milestone that later underpins commercial OCR, surveillance, and autonomous systems.",
    "products": [
      "Convolutional neural nets",
      "Handwriting recognition",
      "Vision AI foundations"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Convolutional_neural_network"
  },
  {
    "year": 1986,
    "month": "",
    "title": "Backpropagation",
    "visual": "📉",
    "summary": "Hinton et al. popularize backprop for training neural nets.",
    "why": "The mathematical foundation of modern Deep Learning.",
    "market_analysis": "Academic breakthrough; laid groundwork for future AI stocks. Enabled scalable ML training.",
    "wiki_url": "https://en.wikipedia.org/wiki/Backpropagation",
    "products": [
      "Neural Network Tools",
      "Deep Learning Frameworks"
    ],
    "stockReaction": "Academic breakthrough; laid groundwork for future AI stocks.",
    "emoji": "📐",
    "imgQuery": "neural network diagram vintage"
  },
  {
    "year": 1985,
    "month": "",
    "title": "Temporal-Difference Reinforcement Learning",
    "visual": "🎯",
    "summary": "Richard Sutton introduces temporal-difference methods, formalizing modern reinforcement learning.",
    "why": "Provided a general framework for learning from rewards, later powering robotics control and game-playing AI.",
    "market_analysis": "Laid groundwork for the deep RL wave decades later, influencing autonomy research and investment.",
    "products": [
      "Autonomous agents",
      "Robotics control algorithms",
      "Adaptive optimization systems"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Reinforcement_learning"
  },
  {
    "year": 1973,
    "month": "",
    "title": "Brain–Computer Interface Coined",
    "visual": "🧠",
    "summary": "Jacques Vidal coins the term Brain–Computer Interface and demonstrates early EEG-based control experiments.",
    "why": "Establishes BCI as a field linking brain signals to machines.",
    "market_analysis": "N/A (Academic Era). Seeds decades of neurotech and assistive robotics research.",
    "products": [
      "EEG-based control systems",
      "Neuro-AI research tools",
      "Assistive interfaces"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface"
  },
  {
    "year": 1972,
    "month": "",
    "title": "MYCIN Expert System",
    "visual": "⚕️",
    "summary": "An AI designed to diagnose bacterial infections.",
    "why": "Proved AI could mimic human expert decision making.",
    "market_analysis": "Boosted interest in symbolic AI research funding. Pioneered expert systems in medicine.",
    "wiki_url": "https://en.wikipedia.org/wiki/MYCIN",
    "products": [
      "Expert Systems",
      "Medical Diagnostics Software"
    ],
    "stockReaction": "Boosted interest in symbolic AI research funding.",
    "emoji": "🏥",
    "imgQuery": "vintage computer medical"
  },
  {
    "year": 1971,
    "month": "",
    "title": "Intel 4004",
    "visual": "💾",
    "summary": "The first commercially available microprocessor.",
    "why": "Shrunk computers from rooms to desktops.",
    "market_analysis": "Launched the Silicon Valley semiconductor era. Enabled personal computing revolution.",
    "wiki_url": "https://en.wikipedia.org/wiki/Intel_4004",
    "products": [
      "Microprocessors",
      "Personal Computers"
    ],
    "stockReaction": "Launched the Silicon Valley semiconductor era.",
    "emoji": "📼",
    "imgQuery": "intel 4004 chip macro"
  },
  {
    "year": 1966,
    "month": "",
    "title": "Shakey the Robot",
    "visual": "🤖",
    "summary": "The first general-purpose mobile robot able to reason.",
    "why": "Combined robotics, computer vision, and planning.",
    "market_analysis": "Funded largely by DARPA; military/research impact. Foundation for autonomous robotics.",
    "wiki_url": "https://en.wikipedia.org/wiki/Shakey_the_robot",
    "products": [
      "Mobile Robots",
      "AI Planning Systems"
    ],
    "stockReaction": "Funded largely by DARPA; military/research impact.",
    "emoji": "📷",
    "imgQuery": "shakey the robot sri"
  },
  {
    "year": 1965,
    "month": "",
    "title": "Fuzzy Logic",
    "visual": "🌫️",
    "summary": "Lotfi Zadeh introduces Fuzzy Logic.",
    "why": "Allowed computers to handle ambiguous data (\"somewhat hot\").",
    "market_analysis": "Widely adopted later in industrial control systems. Improved automation in appliances.",
    "wiki_url": "https://en.wikipedia.org/wiki/Fuzzy_logic",
    "products": [
      "Control Systems",
      "Smart Appliances"
    ],
    "stockReaction": "Widely adopted later in industrial control systems.",
    "emoji": "🌡️",
    "imgQuery": "fuzzy logic diagram math"
  },
  {
    "year": 1961,
    "month": "",
    "title": "Unimate Installed at GM",
    "visual": "🏭",
    "summary": "The first Unimate industrial robot is deployed on a General Motors assembly line to handle hot die-cast parts.",
    "why": "Marked the start of real-world industrial robotics and automated manufacturing.",
    "market_analysis": "Improved factory throughput and safety, seeding the global industrial robotics market.",
    "products": [
      "Industrial robot arms",
      "Automated assembly lines",
      "Factory safety automation"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Unimate"
  },
  {
    "year": 1958,
    "month": "",
    "title": "Perceptron & LISP",
    "visual": "👁️",
    "summary": "Rosenblatt invents the Perceptron; McCarthy creates LISP.",
    "why": "Hardware for learning and software for reasoning.",
    "market_analysis": "N/A (Academic Era). Laid foundations for neural networks and programming languages.",
    "wiki_url": "https://en.wikipedia.org/wiki/Perceptron",
    "products": [
      "Neural Networks",
      "Programming Languages"
    ],
    "stockReaction": "N/A (Academic Era)",
    "emoji": "📜",
    "imgQuery": "vintage computer punch cards"
  },
  {
    "year": 1956,
    "month": "",
    "title": "Dartmouth Conference",
    "visual": "🎓",
    "summary": "The term \"Artificial Intelligence\" is coined.",
    "why": "The official birth of AI as a research field.",
    "market_analysis": "N/A (Academic Era). Sparked global AI research investments.",
    "wiki_url": "https://en.wikipedia.org/wiki/Dartmouth_Conference",
    "products": [
      "AI Research Tools",
      "Symbolic AI Systems"
    ],
    "stockReaction": "N/A (Academic Era)",
    "emoji": "🏫",
    "imgQuery": "dartmouth college 1950s"
  },
  {
    "year": 1954,
    "month": "",
    "title": "Unimate Robot",
    "visual": "🏗️",
    "summary": "First programmable industrial robot patent.",
    "why": "The grandfather of all factory automation.",
    "market_analysis": "Revolutionized GM assembly lines in the 60s. Enabled mass manufacturing automation.",
    "wiki_url": "https://en.wikipedia.org/wiki/Unimate",
    "products": [
      "Industrial Robots",
      "Automated Assembly Lines"
    ],
    "stockReaction": "Revolutionized GM assembly lines in the 60s.",
    "emoji": "🏭",
    "imgQuery": "unimate robot arm 1960s"
  },
  {
    "year": 1950,
    "month": "",
    "title": "Turing Test",
    "visual": "🧠",
    "summary": "Alan Turing proposes the \"Imitation Game\".",
    "why": "Defined the ultimate goal of machine intelligence.",
    "market_analysis": "N/A. Influenced AI development and ethical discussions.",
    "wiki_url": "https://en.wikipedia.org/wiki/Turing_test",
    "products": [
      "AI Evaluation Tools",
      "Conversational Agents"
    ],
    "stockReaction": "N/A",
    "emoji": "♟️",
    "imgQuery": "alan turing computer"
  },
  {
    "year": 1949,
    "month": "",
    "title": "Hebbian Learning",
    "visual": "🧩",
    "summary": "Donald Hebb proposes the rule \"neurons that fire together wire together.\"",
    "why": "Foundational idea for learning in neural networks and modern synaptic plasticity models.",
    "market_analysis": "N/A (Academic Era). Shapes decades of computational neuroscience and AI research.",
    "products": [
      "Learning rules",
      "Neural network theory",
      "Computational neuroscience"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Hebbian_theory"
  },
  {
    "year": 1948,
    "month": "",
    "title": "Cybernetics",
    "visual": "🌀",
    "summary": "Norbert Wiener publishes \"Cybernetics\".",
    "why": "Established the study of control and communication in machines.",
    "market_analysis": "N/A. Influenced control systems and AI theory.",
    "wiki_url": "https://en.wikipedia.org/wiki/Cybernetics",
    "products": [
      "Control Systems",
      "Feedback Mechanisms"
    ],
    "stockReaction": "N/A",
    "emoji": "📖",
    "imgQuery": "cybernetics book vintage"
  },
  {
    "year": 1947,
    "month": "",
    "title": "The Transistor",
    "visual": "⚡",
    "summary": "Bell Labs invents the point-contact transistor.",
    "why": "Replaced vacuum tubes; made modern tech possible.",
    "market_analysis": "Economic Impact: Infinite. Created the Digital Age. Enabled miniaturization of electronics.",
    "wiki_url": "https://en.wikipedia.org/wiki/Transistor",
    "products": [
      "Transistors",
      "Electronic Devices"
    ],
    "stockReaction": "Economic Impact: Infinite. Created the Digital Age.",
    "emoji": "💡",
    "imgQuery": "first transistor bell labs"
  },
  {
    "year": 1945,
    "month": "",
    "title": "ENIAC",
    "visual": "🖥️",
    "summary": "First general-purpose electronic computer.",
    "why": "Demonstrated massive speed for calculation.",
    "market_analysis": "Economic Impact: Shifted military/science to digital. Pioneered programmable computing.",
    "wiki_url": "https://en.wikipedia.org/wiki/ENIAC",
    "products": [
      "Electronic Computers",
      "Digital Calculators"
    ],
    "stockReaction": "Economic Impact: Shifted military/science to digital.",
    "emoji": "🔌",
    "imgQuery": "eniac computer room"
  },
  {
    "year": 1943,
    "month": "",
    "title": "Neural Networks",
    "visual": "🕸️",
    "summary": "McCulloch & Pitts model artificial neurons.",
    "why": "The theoretical ancestor of modern Deep Learning.",
    "market_analysis": "N/A. Foundation for modern AI and machine learning.",
    "wiki_url": "https://en.wikipedia.org/wiki/Artificial_neural_network",
    "products": [
      "Neural Network Models",
      "AI Algorithms"
    ],
    "stockReaction": "N/A",
    "emoji": "🧠",
    "imgQuery": "artificial neuron diagram vintage"
  },
  {
    "year": 1937,
    "month": "",
    "title": "Analytical Engine",
    "visual": "⚙️",
    "summary": "Babbage designs the first general mechanical computer.",
    "why": "The Victorian ancestor of the modern CPU.",
    "market_analysis": "Economic Impact: None at the time (it wasn't built). Influenced mechanical computing concepts.",
    "wiki_url": "https://en.wikipedia.org/wiki/Analytical_Engine",
    "products": [
      "Mechanical Computers",
      "Programmable Calculators"
    ],
    "stockReaction": "Economic Impact: None at the time (it wasn't built).",
    "emoji": "🎩",
    "imgQuery": "charles babbage analytical engine"
  },
  {
    "year": 1929,
    "month": "",
    "title": "EEG Invented",
    "visual": "📈",
    "summary": "Hans Berger records the first human electroencephalogram (EEG), revealing measurable brain waves.",
    "why": "Enables noninvasive brain-signal monitoring, later powering neurofeedback and modern BCIs.",
    "market_analysis": "N/A (Academic/Medical Era). Becomes a core tool in neurology and cognitive science, eventually feeding AI-based decoding.",
    "products": [
      "EEG scanners",
      "Neurodiagnostics",
      "Brain-signal datasets"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Electroencephalography"
  },
  {
    "year": 1899,
    "month": "",
    "title": "Nickel-Cadmium Rechargeable Battery",
    "visual": "🔋",
    "summary": "Waldemar Jungner invents the nickel–cadmium (Ni‑Cd) battery, one of the first practical rechargeable chemistries.",
    "why": "Enabled durable, repeat‑use power sources for early portable tools and devices.",
    "market_analysis": "Expanded the market for rechargeable energy storage long before lithium, influencing industrial and consumer electrification.",
    "products": [
      "Rechargeable cells",
      "Portable power tools",
      "Early electronic devices"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Nickel%E2%80%93cadmium_battery"
  },
  {
    "year": 1879,
    "month": "",
    "title": "Electric Light",
    "visual": "💡",
    "summary": "Edison commercializes the light bulb.",
    "why": "Built the grid infrastructure we plug robots into today.",
    "market_analysis": "Economic Impact: Created the Utility Industry. Extended working hours and productivity.",
    "wiki_url": "https://en.wikipedia.org/wiki/Incandescent_light_bulb",
    "products": [
      "Light Bulbs",
      "Electrical Grids"
    ],
    "stockReaction": "Economic Impact: Created the Utility Industry.",
    "emoji": "🌃",
    "imgQuery": "edison light bulb vintage"
  },
  {
    "year": 1859,
    "month": "",
    "title": "Lead-Acid Battery Invented",
    "visual": "⚡",
    "summary": "Gaston Planté invents the first rechargeable lead–acid battery.",
    "why": "First practical way to store electricity, enabling early electric vehicles, telegraph backup, and later automotive starters.",
    "market_analysis": "Kickstarted commercial energy storage and supported the build‑out of electrical infrastructure.",
    "products": [
      "Automotive starter batteries",
      "UPS systems",
      "Telecom backup power"
    ],
    "wiki_url": "https://en.wikipedia.org/wiki/Lead%E2%80%93acid_battery"
  },
  {
    "year": 1856,
    "month": "",
    "title": "Bessemer Process",
    "visual": "🏗️",
    "summary": "Henry Bessemer patents the first process for mass-producing steel.",
    "why": "Enabled cheap, strong steel for railways, buildings, and machinery.",
    "market_analysis": "Lowered the cost of steel production by 80%, enabling the railroad boom and modern skyscrapers.",
    "wiki_url": "https://en.wikipedia.org/wiki/Bessemer_process",
    "products": [
      "Railways",
      "Engine Blocks",
      "Industrial Gears"
    ],
    "stockReaction": "Carnegie Steel became the world's most profitable company.",
    "emoji": "⚙️",
    "imgQuery": "bessemer converter industrial"
  },
  {
    "year": 1821,
    "month": "",
    "title": "Electric Motor",
    "visual": "⚙️",
    "summary": "Faraday builds the first electric motor.",
    "why": "Provided the muscle (actuation) for future robots.",
    "market_analysis": "Economic Impact: Electrification of industry. Enabled mechanical automation.",
    "wiki_url": "https://en.wikipedia.org/wiki/Electric_motor",
    "products": [
      "Electric Motors",
      "Industrial Machinery"
    ],
    "stockReaction": "Economic Impact: Electrification of industry.",
    "emoji": "🧲",
    "imgQuery": "faraday electric motor"
  },
  {
    "year": 1800,
    "month": "",
    "title": "Voltaic Pile",
    "visual": "🔋",
    "summary": "Alessandro Volta invents the first battery.",
    "why": "Enabled portable electric power for the first time.",
    "market_analysis": "Economic Impact: The birth of Electrochemistry. Foundation for all modern batteries.",
    "wiki_url": "https://en.wikipedia.org/wiki/Voltaic_pile",
    "products": [
      "Batteries",
      "Electrochemical Devices"
    ],
    "stockReaction": "Economic Impact: The birth of Electrochemistry.",
    "emoji": "🧪",
    "imgQuery": "voltaic pile battery"
  },
  {
    "year": 1679,
    "month": "",
    "title": "Leibniz's Binary System",
    "visual": "🔢",
    "summary": "Gottfried Leibniz develops the binary numeral system.",
    "why": "Foundation for digital logic, enabling modern computing and AI.",
    "market_analysis": "Economic Impact: Influenced later calculators and computers, boosting scientific productivity.",
    "wiki_url": "https://en.wikipedia.org/wiki/Gottfried_Wilhelm_Leibniz",
    "products": [
      "Binary Calculators",
      "Digital Systems"
    ],
    "stockReaction": "N/A (Pre-Industrial Era)",
    "emoji": "🔢",
    "imgQuery": "leibniz binary system diagram"
  },
  {
    "year": 50,
    "month": "",
    "title": "Hero's Aeolipile",
    "visual": "💨",
    "summary": "Hero of Alexandria invents the aeolipile, the first steam turbine.",
    "why": "Demonstrated steam energy for rotation, laying groundwork for batteries and mechanical power.",
    "market_analysis": "Economic Impact: Inspired later steam engines, though not immediately commercialized.",
    "wiki_url": "https://en.wikipedia.org/wiki/Aeolipile",
    "products": [
      "Steam Turbines",
      "Early Engines"
    ],
    "stockReaction": "N/A (Ancient Era)",
    "emoji": "⚙️",
    "imgQuery": "hero of alexandria aeolipile steam"
  },
  {
    "year": -2400,
    "month": "",
    "title": "Invention of the Abacus",
    "visual": "🧮",
    "summary": "Babylonians develop the abacus for arithmetic calculations.",
    "why": "Early tool for data manipulation, precursor to computing and AI algorithms.",
    "market_analysis": "Economic Impact: Improved trade calculations, enabling complex economies and record-keeping.",
    "wiki_url": "https://en.wikipedia.org/wiki/Abacus",
    "products": [
      "Calculating Devices",
      "Early Computers"
    ],
    "stockReaction": "N/A (Ancient Era)",
    "emoji": "🧮",
    "imgQuery": "ancient babylonian abacus"
  },
  {
    "year": -3000,
    "month": "",
    "title": "Bronze Age Smelting",
    "visual": "🔥",
    "summary": "Humans learn to smelt copper and tin into bronze, creating durable tools.",
    "why": "Foundation for metallurgy, enabling stronger materials for batteries (electrodes) and robotics (gears).",
    "market_analysis": "Economic Impact: Shifted societies from stone to metal tools, fueling trade and warfare economies.",
    "wiki_url": "https://en.wikipedia.org/wiki/Bronze_Age",
    "products": [
      "Bronze Tools",
      "Weapons",
      "Early Machinery"
    ],
    "stockReaction": "N/A (Ancient Era)",
    "emoji": "⚒️",
    "imgQuery": "bronze age smelting furnace"
  },
  {
    "year": -3500,
    "month": "",
    "title": "Invention of the Wheel",
    "visual": "🛞",
    "summary": "Mesopotamians invent the wheel, enabling efficient transport and machinery.",
    "why": "Revolutionized energy exertion through rotation, powering mills and vehicles that manipulate the world.",
    "market_analysis": "Economic Impact: Enabled trade networks and agriculture, boosting productivity and early industrialization.",
    "wiki_url": "https://en.wikipedia.org/wiki/Wheel",
    "products": [
      "Carts",
      "Water Wheels",
      "Windmills"
    ],
    "stockReaction": "N/A (Prehistoric Era)",
    "emoji": "🛞",
    "imgQuery": "ancient mesopotamian wheel invention"
  }
]
